Repository: zhyfans/OmniPlay
Catalog: OmniPlay开源-mac-ARM/OmniPlay/Localizable.xcstrings
Source language: zh_hans
Languages: en

# %lld. %@ %@ 第 %lld 集
source: %1$lld. %2$@ %3$@ 第 %4$lld 集
en: %lld. %@ %@ Episode %lld

source: ⚠️ 该源地址已存在！
en: ⚠️ This source address already exists!

source: 💡 提示：无需端口号，IP 后面直接加斜杠和“共享文件夹名”（如 /电影）
en: 💡 Tip: No port needed. Add a slash and "Shared Folder Name" after the IP (e.g., /Movies).

source: API Key / v4 令牌
en: API Key / v4 Token

source: SMB 局域网
en: SMB (LAN)

source: 一键修复缺失数据
en: One-Click Repair Missing Data

source: 一键填入
en: Autofill

source: 上映时间 (如: 2025-01-01)
en: Release Date (e.g., 2025-01-01)

source: 中文
en: Chinese

source: 中文优先 (简/繁)
en: Chinese Preferred (Simp/Trad)

source: 保存修改并锁定
en: Save Changes

source: 偏好设置
en: Preferences

source: 关联此项
en: Link This Item

source: 关闭字幕
en: Subtitles Off

source: 准备播放环境...
en: Preparing playback environment...

source: 删除文件夹时保留本地缓存海报
en: Keep cached posters when removing folders

source: 刮削服务 (TMDB)
en: Metadata Provider (TMDB)

source: 剧情简介
en: Overview / Synopsis

source: 取消
en: Cancel

source: 同步
en: Sync

source: 后台扫描本地库，并为评分为 0 或缺失资料的影视重新拉取数据。
en: Scan library in background and refetch data for titles with 0 rating or missing info.

source: 启动时自动扫描并同步库
en: Auto-scan and sync library on startup

source: 启用快速悬停提示 (Tooltip)
en: Enable Tooltips

source: 基础信息
en: Basic Info

source: 基础设置
en: Basic Settings

source: 大号字体 (20)
en: Large Font (20)

source: 媒体库空空如也，快去添加文件夹吧！
en: Your library is empty. Add a folder to get started!

source: 字幕
en: Subtitles

source: 密码 (可选)
en: Password (Optional)

source: 将当前浏览的目录添加到主页，并开始自动刮削海报
en: Add the current directory to Home and start auto-scraping posters.

source: 将批量解除首页库的所有影视卡片的锁定状态。
en: This will bulk unlock all movie cards in the library.

source: 将批量锁定首页库的所有影视卡片，不再参与自动刮削。
en: This will bulk lock all movie cards in the library; they will no longer be auto-scraped.

source: 小号字体 (12)
en: Small Font (12)

source: 已挂载媒体源：
en: Mounted Media Sources:

source: 已播
en: Watched

source: 已添加
en: Added

source: 已锁定 (跳过自动刮削)
en: Locked (Skip Auto-Scraping)

source: 影视名称
en: Title

source: 我的觅影库
en: My Library

source: 所有影视
en: All Media

source: 手动编辑资料
en: Edit Metadata Manually

source: 批量解锁
en: Bulk Unlock

source: 批量解锁全部影视
en: Bulk Unlock All Titles

source: 批量锁定
en: Bulk Lock

source: 批量锁定全部影视
en: Bulk Lock All Titles

source: 搜索
en: Search

source: 搜索...
en: Search…

source: 搜索当前目录...
en: Search current directory...

source: 数据修复工具
en: Data Repair Tool

source: 文件: %@
en: File: %@

source: 日语
en: Japanese

source: 显示名称 (如: 群晖影视库)
en: Display Name (e.g., Synology Library)

source: 智能匹配 (制片国家语言)
en: Smart Match (Origin Country Language)

source: 暂无搜索结果，请输入关键字后回车开始匹配
en: No results. Enter keywords and press Enter to match.

source: 暂无源
en: No Sources

source: 更改此项将改变 TMDB 刮削获取的海报和简介语言。注意：UI 菜单翻译需配合 Xcode 的 String Catalog 使用。
en: Changing this will update the language of posters and overviews fetched from TMDB.

source: 未发现附近设备
en: No nearby devices found

source: 未播
en: Unwatched

source: 未锁定
en: Unlocked

source: 本地文件夹
en: Local Folder

source: 标准字体 (16)
en: Standard Font (16)

source: 标记为已播
en: Mark as Watched

source: 标记为已播？
en: Mark as Watched？

source: 标记后，该影片将被视为已看完，并从“继续播放”列表中移除。
en: Once marked, this title will be considered watched and removed from "Continue Watching".

source: 正在向 TMDB 请求数据...
en: Requesting data from TMDB...

source: 正在扫描网络环境...
en: Scanning network...

source: 海报管理
en: Poster Management

source: 添加
en: Add

source: 添加 %@ 服务器
en: Add %@ Server

source: 源文件信息
en: File Info

source: 源文件名称：
en: Filename

source: 特别篇
en: Specials

source: 特大字体 (24)
en: Extra Large Font (24)

source: 用户名 (可选)
en: Username (Optional)

source: 目录: %@
en: Directory / Path: %@

source: 确定
en: Confirm

source: 确定解锁
en: Confirm Unlock

source: 确定锁定
en: Confirm Lock

source: 空文件夹
en: Empty Folder

source: 第 %lld 季
en: Season %lld

source: 简体中文
en: Simplified Chinese

source: 继续播放
en: Continue Watching

source: 英语
en: English

source: 英语优先
en: English Preferred

source: 设为刮削源
en: Set as Metadata Source

source: 设置
en: Settings

source: 评分 (0.0 - 10.0)
en: Rating (0.0 - 10.0)

source: 语言与播放偏好
en: Language & Playback Preferences

source: 请进入具体的影片分类文件夹（如：电影），然后点击右上角“设为刮削源”
en: Please enter a specific category folder (e.g., Movies), then click "Set as Metadata Source" in the top right.

source: 软件与刮削语言
en: App & Metadata Language

source: 输入正确的影视名称进行搜索...
en: Enter correct title to search...

source: 返回上一级目录
en: Back to Parent Directory

source: 退回媒体库
en: Back to Library

source: 选择本地图片...
en: Select Local Image...

source: 重新匹配 TMDB
en: Rematch with TMDB

source: 重新搜索匹配
en: Research & Match

source: 附近的局域网设备
en: Nearby Network Devices

source: 音轨
en: Audio Track

source: 验证
en: Verify

source: 验证中...
en: Verifying...

source: 验证并添加
en: Verify and Add

source: 默认首选字幕
en: Default Subtitles

source: 默认首选音轨
en: Default Audio Track
